codeigniter/app/Controllers/User.php

    public function store()
    {
        $userModel = new UserModel(); // Call user model
        // Get data from post form
        $username = $this->request->getPost('username');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Check for duplicate email and username
        if ($userModel->is_email_exist($email)) {
            return redirect()->to('/register')->with('error', 'Email already exists.');
        }

        if ($userModel->is_username_exist($username)) {
            return redirect()->to('/register')->with('error', 'Username already exists.');
        }

        // Store them in data array to save by model
        $data = [
            'username' => $username,
            'email' => $email,
            'password' => password_hash((string)$password, PASSWORD_DEFAULT) // Hashed password for security
        ];

        $userModel->save($data);
---
INSERT INTO `users` (`username`, `email`, `password`) VALUES ('iskobado', 'cocnambawan@gmail.com', '$2y$10$wsIlIsZzRHHKUzNN8Y/Dyu3bZO1.Wcwas6xiVx/caOSi.GnzhvD6q')

    public function verifylogin()
    {
        // Call model
        $userModel = new UserModel();

        // Get data from post form
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Check if user exists in the database
        $data = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'iskobado'
 LIMIT 1

    public function profile()
    {
        // Redirect to login if accessing profile page without logging in
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Get the currently logged-in user's ID
        $userId = session()->get('id');

        // Load the user model
        $userModel = new UserModel();

        // Retrieve the user's data from the database
        $userData = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '39'