codeigniter/app/Models/UserModel.php

    public function is_email_exist($email, $userId = null) {
        $builder = $this->db->table($this->table);
        $builder->where('email', $email);
        if ($userId) {
            $builder->where('id !=', $userId); // Exclude current user if updating
        }
        return $builder->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email` = 'cocnambawan@gmail.com'
AND `id` != '40'

    public function is_username_exist($username, $userId = null) {
        $builder = $this->db->table($this->table);
        $builder->where('username', $username);
        if ($userId) {
            $builder->where('id !=', $userId); // Exclude current user if updating
        }
        return $builder->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `username` = 'gotu'
AND `id` != '40'